MikroElektronika/core_packages/PIC/XC8/def/PIC18F45J11/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F45J11_H_
#define _PIC18F45J11_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F45J11
 */
#ifndef _XC_H_
#warning Header file pic18f45j11.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: RPOR0
#define RPOR0 RPOR0
extern volatile unsigned char           RPOR0               __at(0xEC6);
#ifndef _LIB_BUILD
asm("RPOR0 equ 0EC6h");
#endif

// Register: RPOR1
#define RPOR1 RPOR1
extern volatile unsigned char           RPOR1               __at(0xEC7);
#ifndef _LIB_BUILD
asm("RPOR1 equ 0EC7h");
#endif

// Register: RPOR2
#define RPOR2 RPOR2
extern volatile unsigned char           RPOR2               __at(0xEC8);
#ifndef _LIB_BUILD
asm("RPOR2 equ 0EC8h");
#endif

// Register: RPOR3
#define RPOR3 RPOR3
extern volatile unsigned char           RPOR3               __at(0xEC9);
#ifndef _LIB_BUILD
asm("RPOR3 equ 0EC9h");
#endif

// Register: RPOR4
#define RPOR4 RPOR4
extern volatile unsigned char           RPOR4               __at(0xECA);
#ifndef _LIB_BUILD
asm("RPOR4 equ 0ECAh");
#endif

// Register: RPOR5
#define RPOR5 RPOR5
extern volatile unsigned char           RPOR5               __at(0xECB);
#ifndef _LIB_BUILD
asm("RPOR5 equ 0ECBh");
#endif

// Register: RPOR6
#define RPOR6 RPOR6
extern volatile unsigned char           RPOR6               __at(0xECC);
#ifndef _LIB_BUILD
asm("RPOR6 equ 0ECCh");
#endif

// Register: RPOR7
#define RPOR7 RPOR7
extern volatile unsigned char           RPOR7               __at(0xECD);
#ifndef _LIB_BUILD
asm("RPOR7 equ 0ECDh");
#endif

// Register: RPOR8
#define RPOR8 RPOR8
extern volatile unsigned char           RPOR8               __at(0xECE);
#ifndef _LIB_BUILD
asm("RPOR8 equ 0ECEh");
#endif

// Register: RPOR9
#define RPOR9 RPOR9
extern volatile unsigned char           RPOR9               __at(0xECF);
#ifndef _LIB_BUILD
asm("RPOR9 equ 0ECFh");
#endif

// Register: RPOR10
#define RPOR10 RPOR10
extern volatile unsigned char           RPOR10              __at(0xED0);
#ifndef _LIB_BUILD
asm("RPOR10 equ 0ED0h");
#endif

// Register: RPOR11
#define RPOR11 RPOR11
extern volatile unsigned char           RPOR11              __at(0xED1);
#ifndef _LIB_BUILD
asm("RPOR11 equ 0ED1h");
#endif

// Register: RPOR12
#define RPOR12 RPOR12
extern volatile unsigned char           RPOR12              __at(0xED2);
#ifndef _LIB_BUILD
asm("RPOR12 equ 0ED2h");
#endif

// Register: RPOR13
#define RPOR13 RPOR13
extern volatile unsigned char           RPOR13              __at(0xED3);
#ifndef _LIB_BUILD
asm("RPOR13 equ 0ED3h");
#endif

// Register: RPOR14
#define RPOR14 RPOR14
extern volatile unsigned char           RPOR14              __at(0xED4);
#ifndef _LIB_BUILD
asm("RPOR14 equ 0ED4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOR                   :5;
    };
} RPOR14bits_t;
extern volatile RPOR14bits_t RPOR14bits __at(0xED4);
// bitfield macros
#define _RPOR14_RPOR_POSN                                   0x0
#define _RPOR14_RPOR_POSITION                               0x0
#define _RPOR14_RPOR_SIZE                                   0x5
#define _RPOR14_RPOR_LENGTH                                 0x5
#define _RPOR14_RPOR_MASK                                   0x1F

// Register: RPOR15
#define RPOR15 RPOR15
extern volatile unsigned char           RPOR15              __at(0xED5);
#ifndef _LIB_BUILD
asm("RPOR15 equ 0ED5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOR                   :5;
    };
} RPOR15bits_t;
extern volatile RPOR15bits_t RPOR15bits __at(0xED5);
// bitfield macros
#define _RPOR15_RPOR_POSN                                   0x0
#define _RPOR15_RPOR_POSITION                               0x0
#define _RPOR15_RPOR_SIZE                                   0x5
#define _RPOR15_RPOR_LENGTH                                 0x5
#define _RPOR15_RPOR_MASK                                   0x1F

// Register: RPOR16
#define RPOR16 RPOR16
extern volatile unsigned char           RPOR16              __at(0xED6);
#ifndef _LIB_BUILD
asm("RPOR16 equ 0ED6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOR                   :5;
    };
} RPOR16bits_t;
extern volatile RPOR16bits_t RPOR16bits __at(0xED6);
// bitfield macros
#define _RPOR16_RPOR_POSN                                   0x0
#define _RPOR16_RPOR_POSITION                               0x0
#define _RPOR16_RPOR_SIZE                                   0x5
#define _RPOR16_RPOR_LENGTH                                 0x5
#define _RPOR16_RPOR_MASK                                   0x1F

// Register: RPOR17
#define RPOR17 RPOR17
extern volatile unsigned char           RPOR17              __at(0xED7);
#ifndef _LIB_BUILD
asm("RPOR17 equ 0ED7h");
#endif

// Register: RPOR18
#define RPOR18 RPOR18
extern volatile unsigned char           RPOR18              __at(0xED8);
#ifndef _LIB_BUILD
asm("RPOR18 equ 0ED8h");
#endif

